## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/a3d0cd58879c501c0ae584b5f47ab342.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6bb3ec3a0fe15586a7d57e2517477c2f-4" -> (known after apply)
      ~ id                     = "a3d0cd58879c501c0ae584b5f47ab342.zip" -> (known after apply)
      ~ key                    = "a3d0cd58879c501c0ae584b5f47ab342.zip" -> "fbe93c1e1b419ddd34b8bace97e580c8.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "KDG8gaLiZN.6C0m.rUYzdZnfe7Pj7yuR" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2026-02-17T21:46:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadFFISSpreadsheet:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadFFISSpreadsheet:2/invocations" -> (known after apply)
      ~ s3_key                         = "a3d0cd58879c501c0ae584b5f47ab342.zip" -> "fbe93c1e1b419ddd34b8bace97e580c8.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/4b001776a920d248813fbb2a9062c139.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "7aa41fab68314e5bea4e57cd02d0eb39-4" -> (known after apply)
      ~ id                     = "4b001776a920d248813fbb2a9062c139.zip" -> (known after apply)
      ~ key                    = "4b001776a920d248813fbb2a9062c139.zip" -> "c88dcc89388922aa3f42e75d46747dba.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "f1.YujHLbT1LUFU.aIFNeeAQeqMS3pMI" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2026-02-17T21:46:28.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadGrantsGovDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadGrantsGovDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "4b001776a920d248813fbb2a9062c139.zip" -> "c88dcc89388922aa3f42e75d46747dba.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/c852d6004973b8c0f74bbe3e885fa88e.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ce6cc60662b363a34cde66d16f4f8026-4" -> (known after apply)
      ~ id                     = "c852d6004973b8c0f74bbe3e885fa88e.zip" -> (known after apply)
      ~ key                    = "c852d6004973b8c0f74bbe3e885fa88e.zip" -> "3c071da78e3d82a138017c7d41c4a60e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "n0KqGAaCDS2P_aBz9WDADHXYAiYbjMR4" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2026-02-17T21:46:28.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-EnqueueFFISDownload:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-EnqueueFFISDownload:2/invocations" -> (known after apply)
      ~ s3_key                         = "c852d6004973b8c0f74bbe3e885fa88e.zip" -> "3c071da78e3d82a138017c7d41c4a60e.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/18971d8772726d1930cac27ac04c7e6d.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "3bb990fe0409606fb557e7d07fc0edb5-4" -> (known after apply)
      ~ id                     = "18971d8772726d1930cac27ac04c7e6d.zip" -> (known after apply)
      ~ key                    = "18971d8772726d1930cac27ac04c7e6d.zip" -> "37a7a388262ad22d557abe2ccf71376a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "nqceVsIRCUAboJHbuDQkfd8UUkC2ddbc" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2026-02-17T21:46:28.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ExtractGrantsGovDBToXML:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ExtractGrantsGovDBToXML:2/invocations" -> (known after apply)
      ~ s3_key                         = "18971d8772726d1930cac27ac04c7e6d.zip" -> "37a7a388262ad22d557abe2ccf71376a.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/d6abc9b5bdd32511a97a04db56c90c6b.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "882f3a600e5c9807844362ffacbf30c9-4" -> (known after apply)
      ~ id                     = "d6abc9b5bdd32511a97a04db56c90c6b.zip" -> (known after apply)
      ~ key                    = "d6abc9b5bdd32511a97a04db56c90c6b.zip" -> "2c0e8fea725e5df2eed0fbf39945c05c.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "1QLY8h8RdOgBRsHHlRed8y_9uoSWzqoa" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2026-02-17T21:46:28.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistFFISData:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistFFISData:2/invocations" -> (known after apply)
      ~ s3_key                         = "d6abc9b5bdd32511a97a04db56c90c6b.zip" -> "2c0e8fea725e5df2eed0fbf39945c05c.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/9b4c2c2eccdf7a2ce129a3848305628d.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "437d49f3001aeb17fe68f01c28631a82-4" -> (known after apply)
      ~ id                     = "9b4c2c2eccdf7a2ce129a3848305628d.zip" -> (known after apply)
      ~ key                    = "9b4c2c2eccdf7a2ce129a3848305628d.zip" -> "d7d70b7763216e8baadffb3e5ade49a1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ztvcysOu4glPzRj8xjn59fuTGV._RrLx" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2026-02-17T21:46:27.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistGrantsGovXMLDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistGrantsGovXMLDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "9b4c2c2eccdf7a2ce129a3848305628d.zip" -> "d7d70b7763216e8baadffb3e5ade49a1.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/ed897ef2532051a37386ecc607c56819.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d93f008d494121f592783ecc5d87fa8a-4" -> (known after apply)
      ~ id                     = "ed897ef2532051a37386ecc607c56819.zip" -> (known after apply)
      ~ key                    = "ed897ef2532051a37386ecc607c56819.zip" -> "b331fb8646c3240f9447f02654868a6f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "zZR7kfmx771uta.LfAmft8R5Nsl9qz9c" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ last_modified                  = "2026-02-17T21:46:27.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PublishGrantEvents:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PublishGrantEvents:2/invocations" -> (known after apply)
      ~ s3_key                         = "ed897ef2532051a37386ecc607c56819.zip" -> "b331fb8646c3240f9447f02654868a6f.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/7ec345842de1b3fba7480b8130aa75f4.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0ba6e136ee0660158935412bab6ea270-4" -> (known after apply)
      ~ id                     = "7ec345842de1b3fba7480b8130aa75f4.zip" -> (known after apply)
      ~ key                    = "7ec345842de1b3fba7480b8130aa75f4.zip" -> "8e009f44970451d6813550002872b256.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "WZO8WxXHqrUrRQ7w1t2sQmSIx.a3JKoB" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2026-02-17T21:46:28.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ReceiveFFISEmail:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ReceiveFFISEmail:2/invocations" -> (known after apply)
      ~ s3_key                         = "7ec345842de1b3fba7480b8130aa75f4.zip" -> "8e009f44970451d6813550002872b256.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/612330992dd64ee5747d19871d9ef95a.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "c30966f80158ff713e5a6aa9a9a4391b-4" -> (known after apply)
      ~ id                     = "612330992dd64ee5747d19871d9ef95a.zip" -> (known after apply)
      ~ key                    = "612330992dd64ee5747d19871d9ef95a.zip" -> "504c6a59f7632509dc8c850a050c9c98.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "akG4t2F1l7JnxOMEzfF5AkaRXvX6eUzk" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ last_modified                  = "2026-02-17T21:46:28.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitFFISSpreadsheet:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitFFISSpreadsheet:2/invocations" -> (known after apply)
      ~ s3_key                         = "612330992dd64ee5747d19871d9ef95a.zip" -> "504c6a59f7632509dc8c850a050c9c98.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/589ca093fca088b0e3184a9c27cff799.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "7adc160265b4a1ebe4bf15a5f32982ec-4" -> (known after apply)
      ~ id                     = "589ca093fca088b0e3184a9c27cff799.zip" -> (known after apply)
      ~ key                    = "589ca093fca088b0e3184a9c27cff799.zip" -> "273f3723b18a99796b01b3102fca14ff.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "NfzUgHYBdbf3vUumr.iWi22EetHbCcQb" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2026-02-17T21:46:27.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitGrantsGovXMLDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitGrantsGovXMLDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "589ca093fca088b0e3184a9c27cff799.zip" -> "273f3723b18a99796b01b3102fca14ff.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 20 to add, 10 to change, 20 to destroy.
```

</details>

*Pusher: @mdragon, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/navapbc/grants-ingest/actions/runs/22158006740)*